app/controllers/tools_controller.rb

SELECT * FROM "tools" WHERE ("tools"."id" = 953125641)
---
  def show
    @tool = Tool.find(params[:id])

SELECT * FROM "tools" WHERE ("tools"."id" = 953125641)
---
  def edit
    @tool = Tool.find(params[:id])

INSERT INTO "tools" ("name", "updated_at", "kind", "url", "created_at") VALUES(NULL, '2009-03-30 20:37:07', NULL, NULL, '2009-03-30 20:37:07')
---
  def create
    @tool = Tool.new(params[:tool])

    respond_to do |format|
      if @tool.save

SELECT * FROM "tools" WHERE ("tools"."id" = 953125641)
---
  def update
    @tool = Tool.find(params[:id])

SELECT * FROM "tools" WHERE ("tools"."id" = 953125641)
DELETE FROM "tools" WHERE "id" = 953125641
---
  def destroy
    @tool = Tool.find(params[:id])
    @tool.destroy